public/queztaz/qemu/qemu-windows-xp-installation/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link rel="icon" href="/favicon.ico" type="image/x-icon"/>
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  
  <title>Queztaz/Qemu Windows Xp Installation</title>
  <h1>Qemu Windows Xp Installation</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Qemu Windows Xp Installation</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Installation</a>
<ul>
<li><a href="#headline-4">Dependencies</a>
</li>
<li><a href="#headline-5">Installing Windows XP</a>
</li>
<li><a href="#headline-6">Installing Mouse Drivers</a>
</li>
<li><a href="#headline-7">Installing Ethernet and Display Drivers</a>
</li>
<li><a href="#headline-8">Sharing HOST folder through SMB</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Qemu Windows Xp Installation
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Installation
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Dependencies
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li><a href="https://archive.org/download/WinXPProSP3x86/en_windows_xp_professional_with_service_pack_3_x86_cd_vl_x14-73974.iso">Windows XP ISO (archive.org)</a></li>
<li><a href="https://fedorapeople.org/groups/virt/virtio-win/direct-downloads/archive-virtio/virtio-win-0.1.141-1/">Virtio Floppy Image (fedorapeople.org)</a></li>
<li>qemu &amp; spice-gtk (installed via apt-get)</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Installing Windows XP
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p><strong>Product Key: MRX3F-47B9T-2487J-KWKMF-RPWBY</strong></p>
<p>
Here&#39;s the shell script to start the installation.
Windows XP will automatically search through the virtio.vfd floppy image when locating the storage drivers.
That floppy image has all the drivers your networking, virtual display, virtio, etc.
<strong>Mouse input and networking won&#39;t work until after you&#39;re logged in</strong>.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>  qemu-system-x86_64 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -enable-kvm <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -cpu host -smp <span style="color:#ae81ff">4</span> <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -m 3G <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -boot d <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -cdrom  <span style="color:#e6db74">&#34;WINDOWSXP.iso&#34;</span> <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -fda <span style="color:#e6db74">&#34;VIRTIO.vfd&#34;</span> <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -vga qxl <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -spice port<span style="color:#f92672">=</span>55555,addr<span style="color:#f92672">=</span>0.0.0.0,disable-ticketing <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -chardev spicevmc,id<span style="color:#f92672">=</span>vdagent,name<span style="color:#f92672">=</span>vdagent <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -device virtio-net,netdev<span style="color:#f92672">=</span>netdevice -netdev user,id<span style="color:#f92672">=</span>netdevice,smb<span style="color:#f92672">=</span>$HOME <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -drive file<span style="color:#f92672">=</span>windowsxp.qcow2,if<span style="color:#f92672">=</span>virtio,cache<span style="color:#f92672">=</span>none,aio<span style="color:#f92672">=</span>native</span></span></code></pre></div>
</div>
<p>
After you run that, use a spice client to connect to the VM. I use spice-gtk.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Installing Mouse Drivers
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>When you log in, WindowsXP is going to open a wizard that lets you automatically add new hardware.
Use your keyboard to go through these prompts.
This step is important since it will install the drivers to get your mouse working</p>
<p>
After that&#39;s done, poweroff the VM and replace your qemu shell script with the following:</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>qemu-system-x86_64 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-enable-kvm <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-daemonize <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-cpu host -smp <span style="color:#ae81ff">4</span> <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-m 3G <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device virtio-net,netdev<span style="color:#f92672">=</span>netdevice -netdev user,id<span style="color:#f92672">=</span>netdevice,smb<span style="color:#f92672">=</span>$HOME <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span> 	-fda <span style="color:#e6db74">&#34;VIRTIO.vfd&#34;</span> <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-usb <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device ich9-usb-ehci1,id<span style="color:#f92672">=</span>usb <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device ich9-usb-uhci1,masterbus<span style="color:#f92672">=</span>usb.0,firstport<span style="color:#f92672">=</span>0,multifunction<span style="color:#f92672">=</span>on <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device ich9-usb-uhci2,masterbus<span style="color:#f92672">=</span>usb.0,firstport<span style="color:#f92672">=</span><span style="color:#ae81ff">2</span> <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device ich9-usb-uhci3,masterbus<span style="color:#f92672">=</span>usb.0,firstport<span style="color:#f92672">=</span><span style="color:#ae81ff">4</span> <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-chardev spicevmc,name<span style="color:#f92672">=</span>usbredir,id<span style="color:#f92672">=</span>usbredirchardev1 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device usb-redir,chardev<span style="color:#f92672">=</span>usbredirchardev1,id<span style="color:#f92672">=</span>usbredirdev1 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-chardev spicevmc,name<span style="color:#f92672">=</span>usbredir,id<span style="color:#f92672">=</span>usbredirchardev2 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device usb-redir,chardev<span style="color:#f92672">=</span>usbredirchardev2,id<span style="color:#f92672">=</span>usbredirdev2 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-chardev spicevmc,name<span style="color:#f92672">=</span>usbredir,id<span style="color:#f92672">=</span>usbredirchardev3 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device usb-redir,chardev<span style="color:#f92672">=</span>usbredirchardev3,id<span style="color:#f92672">=</span>usbredirdev3 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-vga qxl <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-spice port<span style="color:#f92672">=</span>55555,disable-ticketing <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-usbdevice tablet <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device virtio-serial <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-chardev spicevmc,id<span style="color:#f92672">=</span>vdagent,name<span style="color:#f92672">=</span>vdagent <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-device virtserialport,chardev<span style="color:#f92672">=</span>vdagent,name<span style="color:#f92672">=</span>com.redhat.spice.0 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>	-drive file<span style="color:#f92672">=</span>windowsxp.qcow2,if<span style="color:#f92672">=</span>virtio,cache<span style="color:#f92672">=</span>none,aio<span style="color:#f92672">=</span>native</span></span></code></pre></div>
</div>
<p>
You really only need to remove your WindowsXP iso, but I added more qemu arguemnts to enable USB redirection in spice-gtk.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Installing Ethernet and Display Drivers
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>Open up a command prompt and type &#34;devmgmt.msc&#34; to open the <strong>Device Manager</strong>.
Under &#34;Unknown Devices&#34;, right click each item to open the properties, then re-install the driver.
Since our VIRTIO.VFD file is still attached, Windows XP will automatically install the drivers for the networking, display, etc.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Sharing HOST folder through SMB
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>In the shell snippets above, I have <strong>smb=$HOME</strong> added to expose my home folder as an SMB share on the guest.
Qemu will use a newer version of SMB that Windows XP wont support, causing the whole thing to be broken.
To fix this, we have to edit Qemu&#39;s temporary SMB.CONF file while the Virtual Machine is booting up.</p>
<p>
Add the <strong>sed</strong> command to the bottom of your Qemu shell script.
When Windows XP boots up, you should be able to access your files using this UNC path: <code>\\10.0.2.4\qemu</code></p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>  qemu-system-x86_64 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>      -daemonize...
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># Fixing SMB</span>
</span></span><span style="display:flex;"><span>  sed -e <span style="color:#e6db74">&#39;s/\[qemu\]/min protocol = NT1\n\[qemu\]/&#39;</span> -i /tmp/qemu-smb.*/smb.conf</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
